<?php

namespace Database\Seeders\Common\Fortune\ConditionValue;

use App\Models\Content\Type;
use App\Models\Fortune\Condition;
use App\Models\Fortune\ConditionValue;
use Illuminate\Database\Seeder;

class SajuSeeder extends Seeder
{
    public function run(): void
    {
        $ohaeng = ['목', '화', '토', '금', '수'];
        $sibsin = ['비견', '겁재', '식신', '상관', '정재', '편재', '정관', '편관', '정인', '편인'];

        $su = [
            '11', '12', '13', '14', '15', '16', '17', '18', '21', '22', '23', '24', '25', '26', '27', '28',
            '31', '32', '33', '34', '35', '36', '37', '38', '41', '42', '43', '44', '45', '46', '47', '48',
            '51', '52', '53', '54', '55', '56', '57', '58', '61', '62', '63', '64', '65', '66', '67', '68',
            '71', '72', '73', '74', '75', '76', '77', '78', '81', '82', '83', '84', '85', '86', '87', '88',
        ];

        $yugsibgabja = [
            '갑자', '을축', '병인', '정묘', '무진', '기사', '경오', '신미', '임신', '계유', '갑술', '을해',
            '병자', '정축', '무인', '기묘', '경진', '신사', '임오', '계미', '갑신', '을유', '병술', '정해',
            '무자', '기축', '경인', '신묘', '임진', '계사', '갑오', '을미', '병신', '정유', '무술', '기해',
            '경자', '신축', '임인', '계묘', '갑진', '을사', '병오', '정미', '무신', '기유', '경술', '신해',
            '임자', '계축', '갑인', '을묘', '병진', '정사', '무오', '기미', '경신', '신유', '임술', '계해',
        ];

        $saju = [
            'eumyang' => ['음', '양'],
            'ohaeng' => $ohaeng,
            'sibsin' => $sibsin,
            'yugchin' => ['비겁', '식상', '재성', '관성', '인성'],
            'sibgan' => ['갑', '을', '병', '정', '무', '기', '경', '신', '임', '계'],
            'sibiji' => ['자', '축', '인', '묘', '진', '사', '오', '미', '신', '유', '술', '해'],

            'year' => [
                '111', '112', '113', '121', '122', '123', '131', '132', '133', '141', '142', '143', '151', '152',
                '153', '161', '162', '163', '211', '212', '213', '221', '222', '223', '231', '232', '233', '241',
                '242', '243', '251', '252', '253', '261', '262', '263', '311', '312', '313', '321', '322', '323',
                '331', '332', '333', '341', '342', '343', '351', '352', '353', '361', '362', '363', '411', '412',
                '413', '421', '422', '423', '431', '432', '433', '441', '442', '443', '451', '452', '453', '461',
                '462', '463', '511', '512', '513', '521', '522', '523', '531', '532', '533', '541', '542', '543',
                '551', '552', '553', '561', '562', '563', '611', '612', '613', '621', '622', '623', '631', '632',
                '633', '641', '642', '643', '651', '652', '653', '661', '662', '663', '711', '712', '713', '721',
                '722', '723', '731', '732', '733', '741', '742', '743', '751', '752', '753', '761', '762', '763',
                '811', '812', '813', '821', '822', '823', '831', '832', '833', '841', '842', '843', '851', '852',
                '853', '861', '862', '863',
            ],
            'month' => $su,

            'singangyag,1' => ['강', '중', '약'],
            'singangyag,2' => ['강강', '강중', '강약', '중강', '중중', '중약', '약강', '약중', '약약'],
            'singangyag,3' => [
                '강강강', '강강중', '강강약', '강중강', '강중중', '강중약', '강약강', '강약중', '강약약', '중강강', '중강중', '중강약', '중중강', '중중중',
                '중중약', '중약강', '중약중', '중약약', '약강강', '약강중', '약강약', '약중강', '약중중', '약중약', '약약강', '약약중', '약약약',
            ],

            'high_ohaeng' => $ohaeng,
            'yangin' => ['양', '인'],
            'daejeongsu' => $su,
            'shinsal' => ['원진', '충', '오행', '합', '상생'],

            'key,day' => $su,
            'key,month' => $su,

            'ganji,siju' => $yugsibgabja,
            'ganji,ilju' => $yugsibgabja,
            'ganji,wolju' => $yugsibgabja,
            'ganji,nyeonju' => $yugsibgabja,

            'ganji,0' => $yugsibgabja,
            'ganji,1' => $yugsibgabja,
            'ganji,2' => $yugsibgabja,
            'ganji,3' => $yugsibgabja,
            'ganji,4' => $yugsibgabja,
            'ganji,5' => $yugsibgabja,
            'ganji,6' => $yugsibgabja,
            'ganji,7' => $yugsibgabja,

            'daejeongsu,key,day' => $su,
            'daejeongsu,key,month' => $su,

            'daeun,order' => ['순운', '역운'],
            'daeun.daeunsu' => ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],
            'daeun.ganji' => $yugsibgabja,

            'ilju,cheongan' => $sibsin,
            'ilju,jiji' => $sibsin,
            'wolju,cheongan' => $sibsin,
            'wolju,jiji' => $sibsin,
            'nyeonju,cheongan' => $sibsin,
            'nyeonju,jiji' => $sibsin,
        ];

        $typeId = Type::where('name', 'saju')->first()->id;
        foreach ($saju as $key => $values) {
            $conditionIds = Condition::where([
                ['path', 'LIKE', '%'.$key.'%'],
                ['type_id', '=', $typeId],
            ])->pluck('id');

            foreach ($conditionIds as $conditionId) {
                foreach ($values as $value) {
                    ConditionValue::firstOrCreate([
                        'condition_id' => $conditionId,
                        'name' => $value,
                    ]);
                }
            }
        }

        unset($saju);
    }
}
